app/Controllers/Home.php

SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = 6
---
 public function ObtenerId_User()
{
    // 1. Verificar si la librería de autenticación tiene un ID
    $authId = auth()->id();

    if (!$authId) {
        return false; // No hay sesión iniciada
    }

    $userModel = new UserModel();
    $userData = $userModel->find($authId);