app/Controllers/Home.php

    public function Registro_de_produccion_de_hoy()
    {
        $idUser = $this->ObtenerId_User();

        if ($this->ValidarFormulario_productos($idUser) == true) {

            $fecha = $this->fecha();
            $data['token'] = csrf_hash();


            $modelAlmacen = new Almacen();
            $modeloTablaProduccionFecha = new TablaProduccionFecha();
            $modeloTablaProduccionFechaHasProduccionProductos = new TablaProduccionFechaHasProductos();
            $model_Produccion_producto = new Produccion_productos();
            $datos_Productos = new Productos();




            $Formulario_Producto = $this->ValidarFormulario_productos($idUser);
            //buscamos con el id del forulario que producto es el que escogio el usuario
            $Datobuscar = $datos_Productos->Buscar_productos_id($Formulario_Producto['Productos_idProductos']);
            //ya que estamos en contexto de a quien se le va a reducir la cantidad de kilos en el almacen
            //procedemos a hacer las operaciones aritmeticas solo que falta un forech
            $CantidadUso = $datos_Productos->BuscarCantidadUso($Datobuscar);

            //valor limpio de Cantidad_Uso
            $tamañodearreglo = count($CantidadUso);
            //	d($CantidadUso);
            // Insertamos la producción del producto y obtenemos el ID insertado
            $idInsertado = $model_Produccion_producto->insert($Formulario_Producto); // <<-- Se obtiene el ID del registro insertado
---
INSERT INTO `produccion_productos` (`Productos_idProductos`, `Cantidad_Realizada`, `users_id`) VALUES ('17', '100', 1)


                    //var_dump($data);
                    // Actualizar la base de datos
                    $modelAlmacen->where('idAlmacen', $CantidadUso[$i]['idAlmacen'])->set($data)->update();
---
UPDATE `almacen` SET `Cantidad_Existente` = 47.99986
WHERE `idAlmacen` = '5'

 public function ObtenerId_User()
{
    // 1. Verificar si la librería de autenticación tiene un ID
    $authId = auth()->id();

    if (!$authId) {
        return false; // No hay sesión iniciada
    }

    $userModel = new UserModel();
    $userData = $userModel->find($authId);
---
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = 1