app/Models/Empleados.php

SELECT `Nombre`, `NombreSucursal`, `idSucursales`
FROM `empleados`
LEFT JOIN `sucursales` ON `sucursales`.`Empleados_idEmpleados` = `empleados`.`idEmpleados`
WHERE `users_id` = 6
 LIMIT 1
---
    public function BuscarNombre($idUser){

        $resultado = $this->select('Nombre,NombreSucursal,idSucursales')
        ->join('sucursales', 'sucursales.Empleados_idEmpleados = empleados.idEmpleados','left') //Cambie id_user por idEmpleados
    ->where('users_id', $idUser)
    ->first();