app/Models/MercanciaSucursal.php

    public function FuncionBusqueda($fecha,$IdSucursal){

        $resultado = $this->select('idPedidos,Nota,idSalida_Mercancia,Sucursales_idSucursales')
        ->join('salida_mercancia', 'salida_mercancia.idSalida_Mercancia = mercancia_sucursal.Salida_Mercancia_idSalida_Mercancia','left')
        ->where('Tabla_Produccion_Fecha_idTabla_Produccion', $fecha)
        ->where('Sucursales_idSucursales', $IdSucursal)
        ->findAll();
---
SELECT `idPedidos`, `Nota`, `idSalida_Mercancia`, `Sucursales_idSucursales`
FROM `mercancia_sucursal`
LEFT JOIN `salida_mercancia` ON `salida_mercancia`.`idSalida_Mercancia` = `mercancia_sucursal`.`Salida_Mercancia_idSalida_Mercancia`
WHERE `Tabla_Produccion_Fecha_idTabla_Produccion` = ('12')
AND `Sucursales_idSucursales` = '1'