app/Models/MermasModel.php

SELECT `Conteo_Merma`, `productos_idProductos`, `username`, `Nombre_Producto`, `Categoria`, `idSupervision`
FROM `mermas`
LEFT JOIN `users` ON `users`.`id` = `mermas`.`users_id`
LEFT JOIN `productos` ON `productos`.`idProductos` = `mermas`.`productos_idProductos`
WHERE `tabla_produccion_fecha_idTabla_Produccion` = 52
ORDER BY `username` ASC
---
    public function BuscarMermasActuales($id)
    {
        $query = $this->select('Conteo_Merma,productos_idProductos,username,Nombre_Producto,Categoria,idSupervision')
        ->join('users', 'users.id = mermas.users_id','left')
        ->join('productos', 'productos.idProductos = mermas.productos_idProductos','left')
        ->where('tabla_produccion_fecha_idTabla_Produccion', $id)
        ->orderBy('username', 'ASC') // <--- Esta es la línea que los acomoda por usuaria
        ->findAll();