app/Models/PedidosModel.php

    public function BuscarPedidoshoy($fecha)
    {

        $resultado = $this->select('Nombre_Cliente,Fecha_Pedido,Cantidad_requerida,Nombre_Producto')
        ->join('productos', 'productos.idProductos = pedidos.Productos_idProductos','left')
        ->where('Fecha_Pedido', $fecha)
        ->findAll();
---
SELECT `Nombre_Cliente`, `Fecha_Pedido`, `Cantidad_requerida`, `Nombre_Producto`
FROM `pedidos`
LEFT JOIN `productos` ON `productos`.`idProductos` = `pedidos`.`Productos_idProductos`
WHERE `Fecha_Pedido` = '2025-01-27'

    public function ObtenerPedidosPanesHoy($fecha)
    {
        // Seleccionamos los datos incluyendo el teléfono y la sucursal de recolección
        $resultado = $this->select('pedidos.Nombre_Cliente, pedidos.Cantidad_requerida, pedidos.NumeroTelefono, pedidos.Fecha_Pedido, productos.Nombre_Producto, sucursales.NombreSucursal as SucursalRecoleccion')
            ->join('productos', 'productos.idProductos = pedidos.Productos_idProductos', 'left')
            ->join('sucursales', 'sucursales.idSucursales = pedidos.sucursal_recoleccion', 'left')
            ->where('pedidos.Fecha_Pedido', $fecha)
            ->findAll();
---
SELECT `pedidos`.`Nombre_Cliente`, `pedidos`.`Cantidad_requerida`, `pedidos`.`NumeroTelefono`, `pedidos`.`Fecha_Pedido`, `productos`.`Nombre_Producto`, `sucursales`.`NombreSucursal` as `SucursalRecoleccion`
FROM `pedidos`
LEFT JOIN `productos` ON `productos`.`idProductos` = `pedidos`.`Productos_idProductos`
LEFT JOIN `sucursales` ON `sucursales`.`idSucursales` = `pedidos`.`sucursal_recoleccion`
WHERE `pedidos`.`Fecha_Pedido` = '2026-04-29'