app/Models/Productos.php

SELECT `Nombre_Producto`
FROM `productos`
WHERE `idProductos` = '1'
 LIMIT 1
---
	public function Buscar_productos_id($id){
	return $this->select('Nombre_Producto')
	->where('idProductos', $id)
	->first();