app/Models/Productos.php

SELECT `Nombre_Producto`
FROM `productos`
---
	public function Buscar_porNombre($Nombre){
		$this->select('idProductos')
		->where('Nombre_Producto', $Nombre);
		$query = $this->first();

SELECT `Nombre_Producto`, `Categoria`
FROM `productos`
---
	public function Buscar_productosyCategoriasparticular($Nombre){
		$this->select('idProductos,Nombre_Producto,Categoria')
		->where('Nombre_Producto', $Nombre)
		->orWhere('Categoria', $Nombre);
		$query = $this	->first();

SELECT `idAlmacen`, `Nombre_Producto`, `Cantidad_uso`, `Cantidad_Existente`, `Nombre_Materia`, `Cantidad_medida`
FROM `productos`
INNER JOIN `productos_has_almacen` ON `productos_has_almacen`.`Productos_idProductos` = `productos`.`idProductos`
INNER JOIN `almacen` ON `almacen`.`idAlmacen` = `productos_has_almacen`.`Almacen_idAlmacen`
LEFT JOIN `referencias_almacen` ON `referencias_almacen`.`idReferencias_Almacen` = `almacen`.`Referencias_Almacen_idReferencias_Almacen`
WHERE `Nombre_Producto` = ('Cuernitos')
---
	public function BuscarCantidadUso($productos) {
		$resultados = $this->select('idAlmacen, Nombre_Producto, Cantidad_uso, Cantidad_Existente, Nombre_Materia, Cantidad_medida')
			->join('productos_has_almacen', 'productos_has_almacen.Productos_idProductos = productos.idProductos', 'INNER')
			->join('almacen', 'almacen.idAlmacen = productos_has_almacen.Almacen_idAlmacen', 'INNER')
			->join('referencias_almacen', 'referencias_almacen.idReferencias_Almacen = almacen.Referencias_Almacen_idReferencias_Almacen', 'LEFT')
			->where('Nombre_Producto', $productos)
			->findAll();

SELECT `Nombre_Producto`
FROM `productos`
WHERE `idProductos` = '17'
 LIMIT 1
---
	public function Buscar_productos_id($id){
	return $this->select('Nombre_Producto')
	->where('idProductos', $id)
	->first();