app/Models/Produccion_Deseada.php

	public function BuscarProductosDeseados($productos){
		return $this->select('*')
		->join('productos', 'productos.idProductos = produccion_deseada.Productos_idProductos','left')
		-> where('productos.Nombre_Producto', $productos)
		->orderBy('Fecha_Registro', 'DESC')
		->first();
---
SELECT *
FROM `produccion_deseada`
LEFT JOIN `productos` ON `productos`.`idProductos` = `produccion_deseada`.`Productos_idProductos`
WHERE `Nombre_Producto` = 'Bolillos Telera'
ORDER BY `Fecha_Registro` DESC
 LIMIT 1