app/Models/SalidaMercancia.php

public function Buscartotalesconsucursal($fecha,$Sucursal){

    // Validar que $fecha no sea nula o inválida
      if (empty($fecha)) {
         echo "No existe la fecha No se ha generado Produccion en el dia de hoy";
      }

      // Realizar la consulta
      $resultados = $this
          ->select('idSalida_Mercancia,productos.Nombre_Producto, salida_mercancia.Cantidad_Salida , Sucursales_idSucursales')
          ->join('productos', 'productos.idProductos = salida_mercancia.Productos_idProductos', 'INNER')
          ->where('Tabla_Produccion_Fecha_idTabla_Produccion', $fecha)
          ->where('Sucursales_idSucursales', $Sucursal) // Segunda condición
          ->findAll();
---
SELECT `idSalida_Mercancia`, `productos`.`Nombre_Producto`, `salida_mercancia`.`Cantidad_Salida`, `Sucursales_idSucursales`
FROM `salida_mercancia`
INNER JOIN `productos` ON `productos`.`idProductos` = `salida_mercancia`.`Productos_idProductos`
WHERE `Tabla_Produccion_Fecha_idTabla_Produccion` = ('12')
AND `Sucursales_idSucursales` = '1'

public function ObtenerDistribucionParaEliminar($idTablaProduccion)
    {
        if (empty($idTablaProduccion)) {
            return [];
        }

        return $this->select('
                salida_mercancia.idSalida_Mercancia,
                productos.Nombre_Producto,
                salida_mercancia.Cantidad_Salida,
                sucursales.NombreSucursal,
                mercancia_sucursal.Confirmacion_Salida
            ')
            ->join('productos', 'productos.idProductos = salida_mercancia.Productos_idProductos', 'INNER')
            ->join('sucursales', 'sucursales.idSucursales = salida_mercancia.Sucursales_idSucursales', 'INNER')
            ->join('mercancia_sucursal', 'mercancia_sucursal.Salida_Mercancia_idSalida_Mercancia = salida_mercancia.idSalida_Mercancia', 'LEFT')
            ->where('salida_mercancia.Tabla_Produccion_Fecha_idTabla_Produccion', $idTablaProduccion)
            ->orderBy('sucursales.NombreSucursal', 'ASC')
            ->orderBy('salida_mercancia.idSalida_Mercancia', 'DESC')
            ->findAll();
---
SELECT `salida_mercancia`.`idSalida_Mercancia`, `productos`.`Nombre_Producto`, `salida_mercancia`.`Cantidad_Salida`, `sucursales`.`NombreSucursal`, `mercancia_sucursal`.`Confirmacion_Salida`
FROM `salida_mercancia`
INNER JOIN `productos` ON `productos`.`idProductos` = `salida_mercancia`.`Productos_idProductos`
INNER JOIN `sucursales` ON `sucursales`.`idSucursales` = `salida_mercancia`.`Sucursales_idSucursales`
LEFT JOIN `mercancia_sucursal` ON `mercancia_sucursal`.`Salida_Mercancia_idSalida_Mercancia` = `salida_mercancia`.`idSalida_Mercancia`
WHERE `salida_mercancia`.`Tabla_Produccion_Fecha_idTabla_Produccion` = '53'
ORDER BY `sucursales`.`NombreSucursal` ASC, `salida_mercancia`.`idSalida_Mercancia` DESC