app/Models/TablaProduccionFecha.php

    public function UltimaFecha($FechaSistem){

        $resultado = $this->select('idTabla_Produccion')
            ->where('Fecha_de_Produccion', $FechaSistem)
            ->first();

        if ($resultado) {


            return $resultado["idTabla_Produccion"];

        }
        else {
            $this->insert(['Fecha_de_Produccion' => $FechaSistem]);
---
SELECT `idTabla_Produccion`
FROM `tabla_produccion_fecha`
WHERE `Fecha_de_Produccion` = '2026-03-09'
 LIMIT 1
INSERT INTO `tabla_produccion_fecha` (`Fecha_de_Produccion`) VALUES ('2026-03-09')

    public function ConsultarPorduccionRegistrada($fecha){
        return $this->select('Cantidad_Realizada,Nombre_Producto,Fecha_de_Produccion,Categoria')
            ->join('tabla_produccion_fecha_has_produccion_productos', 'tabla_produccion_fecha_has_produccion_productos.Tabla_Produccion_idTabla_Produccion_Fecha = tabla_produccion_fecha.idTabla_Produccion','INNER')
            ->join('produccion_productos', 'produccion_productos.idProduccion_Productos = tabla_produccion_fecha_has_produccion_productos.Produccion_Productos_idProduccion_Productos','INNER')
            ->join('productos', 'productos.idProductos = produccion_productos.Productos_idProductos','INNER')
            -> where('Fecha_de_Produccion', $fecha)
            ->findAll();
---
SELECT `Cantidad_Realizada`, `Nombre_Producto`, `Fecha_de_Produccion`, `Categoria`
FROM `tabla_produccion_fecha`
INNER JOIN `tabla_produccion_fecha_has_produccion_productos` ON `tabla_produccion_fecha_has_produccion_productos`.`Tabla_Produccion_idTabla_Produccion_Fecha` = `tabla_produccion_fecha`.`idTabla_Produccion`
INNER JOIN `produccion_productos` ON `produccion_productos`.`idProduccion_Productos` = `tabla_produccion_fecha_has_produccion_productos`.`Produccion_Productos_idProduccion_Productos`
INNER JOIN `productos` ON `productos`.`idProductos` = `produccion_productos`.`Productos_idProductos`
WHERE `Fecha_de_Produccion` = '2026-02-24'

    public function obtenerFecha($FechaSistem)  {

        $resultado = $this->select('idTabla_Produccion')
            ->where('Fecha_de_Produccion', $FechaSistem)
            ->first();
---
SELECT `idTabla_Produccion`
FROM `tabla_produccion_fecha`
WHERE `Fecha_de_Produccion` = '2026-03-09'
 LIMIT 1

    public function obtenerUltimasFechasIDs($fechaActual)
    {
        return $this->select('Fecha_de_Produccion, idTabla_Produccion')
            ->where('Fecha_de_Produccion <=', $fechaActual)
            ->orderBy('Fecha_de_Produccion', 'DESC')
            ->limit(11)
            ->findAll();
---
SELECT `Fecha_de_Produccion`, `idTabla_Produccion`
FROM `tabla_produccion_fecha`
WHERE `Fecha_de_Produccion` <= '2026-03-13'
ORDER BY `Fecha_de_Produccion` DESC