app/Models/TablaSucursales.php

public function ObtenerSucursalPorUsuario($idUsuario)
    {
        // Ajusta 'idSucursales' y 'NombreSucursal' según tus columnas exactas si varían
        return $this->select('sucursales.idSucursales, sucursales.NombreSucursal')
                    ->join('empleados', 'empleados.idEmpleados = sucursales.Empleados_idEmpleados', 'INNER')
                    ->where('empleados.users_id', $idUsuario)
                    ->first(); // first() nos devuelve un solo arreglo asociativo
---
SELECT `sucursales`.`idSucursales`, `sucursales`.`NombreSucursal`
FROM `sucursales`
INNER JOIN `empleados` ON `empleados`.`idEmpleados` = `sucursales`.`Empleados_idEmpleados`
WHERE `empleados`.`users_id` = 1
 LIMIT 1